In [1]:
import pandas as pd

In [2]:
bike = pd.read_csv('bike.csv')

In [3]:
bike.head()

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0,3,13,16
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0,8,32,40
2,2011-01-01 02:00:00,1,0,0,1,9.02,13.635,80,0.0,5,27,32
3,2011-01-01 03:00:00,1,0,0,1,9.84,14.395,75,0.0,3,10,13
4,2011-01-01 04:00:00,1,0,0,1,9.84,14.395,75,0.0,0,1,1

In [4]:
bike_sub = bike.sample(n = 4, random_state=123)
bike_sub

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
6495,2012-03-07 21:00:00,1,0,1,1,18.04,21.970,62,16.9979,11,177,188
7050,2012-04-12 03:00:00,2,0,1,1,13.12,15.150,61,16.9979,2,3,5
558,2011-02-06 10:00:00,1,0,0,1,12.30,14.395,52,16.9979,15,74,89
5085,2011-12-05 23:00:00,4,0,1,2,18.86,22.725,88,8.9981,8,54,62

In [7]:
bike_sub.reset_index()

,index,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
0,6495,2012-03-07 21:00:00,1,0,1,1,18.04,21.970,62,16.9979,11,177,188
1,7050,2012-04-12 03:00:00,2,0,1,1,13.12,15.150,61,16.9979,2,3,5
2,558,2011-02-06 10:00:00,1,0,0,1,12.30,14.395,52,16.9979,15,74,89
3,5085,2011-12-05 23:00:00,4,0,1,2,18.86,22.725,88,8.9981,8,54,62

In [8]:
bike_sub.reset_index(drop = True)

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
0,2012-03-07 21:00:00,1,0,1,1,18.04,21.970,62,16.9979,11,177,188
1,2012-04-12 03:00:00,2,0,1,1,13.12,15.150,61,16.9979,2,3,5
2,2011-02-06 10:00:00,1,0,0,1,12.30,14.395,52,16.9979,15,74,89
3,2011-12-05 23:00:00,4,0,1,2,18.86,22.725,88,8.9981,8,54,62

In [9]:
bike_sub = bike_sub.reset_index(drop = True)

In [10]:
bike_sub.head()

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
0,2012-03-07 21:00:00,1,0,1,1,18.04,21.970,62,16.9979,11,177,188
1,2012-04-12 03:00:00,2,0,1,1,13.12,15.150,61,16.9979,2,3,5
2,2011-02-06 10:00:00,1,0,0,1,12.30,14.395,52,16.9979,15,74,89
3,2011-12-05 23:00:00,4,0,1,2,18.86,22.725,88,8.9981,8,54,62

In [11]:
bike_sub = bike_sub.set_index("datetime")

In [12]:
bike_sub.head()

,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
datetime,,,,,,,,,,,
2012-03-07 21:00:00,1,0,1,1,18.04,21.970,62,16.9979,11,177,188
2012-04-12 03:00:00,2,0,1,1,13.12,15.150,61,16.9979,2,3,5
2011-02-06 10:00:00,1,0,0,1,12.30,14.395,52,16.9979,15,74,89
2011-12-05 23:00:00,4,0,1,2,18.86,22.725,88,8.9981,8,54,62

In [13]:
bike_sub = bike_sub.reset_index()

In [14]:
bike_sub.head()

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
0,2012-03-07 21:00:00,1,0,1,1,18.04,21.970,62,16.9979,11,177,188
1,2012-04-12 03:00:00,2,0,1,1,13.12,15.150,61,16.9979,2,3,5
2,2011-02-06 10:00:00,1,0,0,1,12.30,14.395,52,16.9979,15,74,89
3,2011-12-05 23:00:00,4,0,1,2,18.86,22.725,88,8.9981,8,54,62

In [15]:
bike.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10886 entries, 0 to 10885
Data columns (total 12 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   datetime    10886 non-null  object
 1   season      10886 non-null  int64
 2   holiday     10886 non-null  int64
 3   workingday  10886 non-null  int64
 4   weather     10886 non-null  int64
 5   temp        10886 non-null  float64
 6   atemp       10886 non-null  float64
 7   humidity    10886 non-null  int64
 8   windspeed   10886 non-null  float64
 9   casual      10886 non-null  int64
 10  registered  10886 non-null  int64
 11  count       10886 non-null  int64
dtypes: float64(3), int64(8), object(1)
memory usage: 1020.7+ KB

In [16]:
bike_1 = bike.iloc[:3, :4]
bike_2 = bike.iloc[5:8, :4]

In [17]:
bike_1

              datetime  season  holiday  workingday
0  2011-01-01 00:00:00       1        0           0
1  2011-01-01 01:00:00       1        0           0
2  2011-01-01 02:00:00       1        0           0

In [18]:
bike_2

              datetime  season  holiday  workingday
5  2011-01-01 05:00:00       1        0           0
6  2011-01-01 06:00:00       1        0           0
7  2011-01-01 07:00:00       1        0           0

In [19]:
pd.concat([bike_1, bike_2])

              datetime  season  holiday  workingday
0  2011-01-01 00:00:00       1        0           0
1  2011-01-01 01:00:00       1        0           0
2  2011-01-01 02:00:00       1        0           0
5  2011-01-01 05:00:00       1        0           0
6  2011-01-01 06:00:00       1        0           0
7  2011-01-01 07:00:00       1        0           0

In [20]:
pd.concat([bike_1, bike_2.reset_index(drop=True)], axis=1)

,datetime,season,holiday,workingday,datetime,season,holiday,workingday
0,2011-01-01 00:00:00,1,0,0,2011-01-01 05:00:00,1,0,0
1,2011-01-01 01:00:00,1,0,0,2011-01-01 06:00:00,1,0,0
2,2011-01-01 02:00:00,1,0,0,2011-01-01 07:00:00,1,0,0

In [22]:
df_A = pd.read_csv('join_data_group_members.csv')
df_A

          team    No member
0        TWICE  1414     미나
1        TWICE  1462     나연
2        TWICE  1178     다현
3        TWICE  1525     정연
4        TWICE  1194     지효
5        TWICE  1937     채연
6        TWICE  1817     모모
7        TWICE  1117     쯔위
8        TWICE  1298     사나
9   Red Velvet  1228    아이린
10  Red Velvet  1243     웬디
11  Red Velvet  1013     슬기
12  Red Velvet  1373     조이
13  Red Velvet  1664     예리

In [23]:
df_B = pd.read_csv('join_data_member_room.csv')
df_B

   floor  room name
0      3  3G-A   미나
1      3  3G-B   나연
2      3  3G-C   다현
3      4  4G-A   정연
4      4  4G-B   지효
5      4  4G-C   채연
6      5  5G-A   모모
7      5  5G-B   쯔위
8      5  5G-C   사나

In [30]:
df_C = df_A.rename(columns= {"member": "name"} )

In [31]:
df_C

          team    No name
0        TWICE  1414   미나
1        TWICE  1462   나연
2        TWICE  1178   다현
3        TWICE  1525   정연
4        TWICE  1194   지효
5        TWICE  1937   채연
6        TWICE  1817   모모
7        TWICE  1117   쯔위
8        TWICE  1298   사나
9   Red Velvet  1228  아이린
10  Red Velvet  1243   웬디
11  Red Velvet  1013   슬기
12  Red Velvet  1373   조이
13  Red Velvet  1664   예리

In [32]:
pd.merge(left = df_C, right = df_B, on = 'name', how = 'inner')

    team    No name  floor  room
0  TWICE  1414   미나      3  3G-A
1  TWICE  1462   나연      3  3G-B
2  TWICE  1178   다현      3  3G-C
3  TWICE  1525   정연      4  4G-A
4  TWICE  1194   지효      4  4G-B
5  TWICE  1937   채연      4  4G-C
6  TWICE  1817   모모      5  5G-A
7  TWICE  1117   쯔위      5  5G-B
8  TWICE  1298   사나      5  5G-C

In [33]:
pd.merge(left = df_C, right = df_B, on = 'name', how = 'left')

          team    No name  floor  room
0        TWICE  1414   미나    3.0  3G-A
1        TWICE  1462   나연    3.0  3G-B
2        TWICE  1178   다현    3.0  3G-C
3        TWICE  1525   정연    4.0  4G-A
4        TWICE  1194   지효    4.0  4G-B
5        TWICE  1937   채연    4.0  4G-C
6        TWICE  1817   모모    5.0  5G-A
7        TWICE  1117   쯔위    5.0  5G-B
8        TWICE  1298   사나    5.0  5G-C
9   Red Velvet  1228  아이린    NaN   NaN
10  Red Velvet  1243   웬디    NaN   NaN
11  Red Velvet  1013   슬기    NaN   NaN
12  Red Velvet  1373   조이    NaN   NaN
13  Red Velvet  1664   예리    NaN   NaN

# Q1

In [36]:
pd.merge(left = df_C, right = df_B, on = 'name', how = 'left').isna().sum()

team     0
No       0
name     0
floor    5
room     5
dtype: int64

In [37]:
pd.merge(left = df_C, right = df_B, on = 'name', how = 'left').isna().sum().max()

np.int64(5)

# Q2

In [157]:
bike_q2 = pd.read_csv('bike.csv')
bike_q2.head()

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0,3,13,16
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0,8,32,40
2,2011-01-01 02:00:00,1,0,0,1,9.02,13.635,80,0.0,5,27,32
3,2011-01-01 03:00:00,1,0,0,1,9.84,14.395,75,0.0,3,10,13
4,2011-01-01 04:00:00,1,0,0,1,9.84,14.395,75,0.0,0,1,1

In [158]:
bike_q2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10886 entries, 0 to 10885
Data columns (total 12 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   datetime    10886 non-null  object
 1   season      10886 non-null  int64
 2   holiday     10886 non-null  int64
 3   workingday  10886 non-null  int64
 4   weather     10886 non-null  int64
 5   temp        10886 non-null  float64
 6   atemp       10886 non-null  float64
 7   humidity    10886 non-null  int64
 8   windspeed   10886 non-null  float64
 9   casual      10886 non-null  int64
 10  registered  10886 non-null  int64
 11  count       10886 non-null  int64
dtypes: float64(3), int64(8), object(1)
memory usage: 1020.7+ KB

In [159]:
q2_sub = bike_q2[['datetime', 'season', 'registered']].copy()
q2_sub

                  datetime  season  registered
0      2011-01-01 00:00:00       1          13
1      2011-01-01 01:00:00       1          32
2      2011-01-01 02:00:00       1          27
3      2011-01-01 03:00:00       1          10
4      2011-01-01 04:00:00       1           1
...                    ...     ...         ...
10881  2012-12-19 19:00:00       4         329
10882  2012-12-19 20:00:00       4         231
10883  2012-12-19 21:00:00       4         164
10884  2012-12-19 22:00:00       4         117
10885  2012-12-19 23:00:00       4          84

[10886 rows x 3 columns]

In [160]:
q2_sub.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10886 entries, 0 to 10885
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   datetime    10886 non-null  object
 1   season      10886 non-null  int64
 2   registered  10886 non-null  int64
dtypes: int64(2), object(1)
memory usage: 255.3+ KB

In [161]:
q2_sub['datetime'] = pd.to_datetime(q2_sub['datetime'])
q2_sub

                 datetime  season  registered
0     2011-01-01 00:00:00       1          13
1     2011-01-01 01:00:00       1          32
2     2011-01-01 02:00:00       1          27
3     2011-01-01 03:00:00       1          10
4     2011-01-01 04:00:00       1           1
...                   ...     ...         ...
10881 2012-12-19 19:00:00       4         329
10882 2012-12-19 20:00:00       4         231
10883 2012-12-19 21:00:00       4         164
10884 2012-12-19 22:00:00       4         117
10885 2012-12-19 23:00:00       4          84

[10886 rows x 3 columns]

In [162]:
q2_sub.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10886 entries, 0 to 10885
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   datetime    10886 non-null  datetime64[ns]
 1   season      10886 non-null  int64
 2   registered  10886 non-null  int64
dtypes: datetime64[ns](1), int64(2)
memory usage: 255.3 KB

In [163]:
q2_sub['hour'] = q2_sub['datetime'].dt.hour

In [164]:
q2_sub.head()

             datetime  season  registered  hour
0 2011-01-01 00:00:00       1          13     0
1 2011-01-01 01:00:00       1          32     1
2 2011-01-01 02:00:00       1          27     2
3 2011-01-01 03:00:00       1          10     3
4 2011-01-01 04:00:00       1           1     4

In [165]:
q2_sub.drop(columns=['datetime'])

       season  registered  hour
0           1          13     0
1           1          32     1
2           1          27     2
3           1          10     3
4           1           1     4
...       ...         ...   ...
10881       4         329    19
10882       4         231    20
10883       4         164    21
10884       4         117    22
10885       4          84    23

[10886 rows x 3 columns]

In [166]:
q2_sub.head()

             datetime  season  registered  hour
0 2011-01-01 00:00:00       1          13     0
1 2011-01-01 01:00:00       1          32     1
2 2011-01-01 02:00:00       1          27     2
3 2011-01-01 03:00:00       1          10     3
4 2011-01-01 04:00:00       1           1     4

In [167]:
q2_sub = q2_sub.drop(columns=['datetime'])

In [168]:
q2_sub.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10886 entries, 0 to 10885
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   season      10886 non-null  int64
 1   registered  10886 non-null  int64
 2   hour        10886 non-null  int32
dtypes: int32(1), int64(2)
memory usage: 212.7 KB

In [169]:
q2_sub_2 = q2_sub[q2_sub['season'] == 2]

In [170]:
q2_sub_4 = q2_sub[q2_sub['season'] == 4]

In [171]:
q2_sub_2 = q2_sub_2.reset_index(drop=True)
# q2_sub_2.drop(columns=['level_0'])

In [172]:
q2_sub_2

      season  registered  hour
0          2           6     0
1          2           4     1
2          2           7     2
3          2           4     3
4          2           3     4
...      ...         ...   ...
2728       2         432    19
2729       2         399    20
2730       2         239    21
2731       2         240    22
2732       2         102    23

[2733 rows x 3 columns]

In [173]:
q2_sub_4 = q2_sub_4.reset_index(drop=True)

In [174]:
q2_sub_4

      season  registered  hour
0          4         106     0
1          4          47     1
2          4          46     2
3          4          17     3
4          4           6     4
...      ...         ...   ...
2729       4         329    19
2730       4         231    20
2731       4         164    21
2732       4         117    22
2733       4          84    23

[2734 rows x 3 columns]

In [175]:
q2_sub_2.groupby('hour')['registered'].mean()

hour
0      45.947368
1      27.473684
2      17.763158
3       8.419643
4       5.053097
5      18.622807
6      77.017544
7     217.280702
8     363.263158
9     199.315789
10    132.894737
11    161.131579
12    198.675439
13    193.245614
14    173.517544
15    186.192982
16    261.456140
17    437.298246
18    412.675439
19    302.298246
20    216.184211
21    161.473684
22    124.956140
23     80.929825
Name: registered, dtype: float64

In [176]:
q2_sub_4.groupby('hour')['registered'].mean()

hour
0      50.017544
1      30.842105
2      18.973684
3       9.116071
4       6.087719
5      21.403509
6      79.368421
7     223.245614
8     385.473684
9     216.201754
10    148.263158
11    172.535088
12    216.236842
13    210.385965
14    193.561404
15    210.666667
16    280.412281
17    427.833333
18    385.728070
19    271.324561
20    193.771930
21    145.210526
22    111.692982
23     78.596491
Name: registered, dtype: float64

In [177]:
abs(q2_sub_2.groupby('hour')['registered'].mean() - q2_sub_4.groupby('hour')['registered'].mean())

hour
0      4.070175
1      3.368421
2      1.210526
3      0.696429
4      1.034622
5      2.780702
6      2.350877
7      5.964912
8     22.210526
9     16.885965
10    15.368421
11    11.403509
12    17.561404
13    17.140351
14    20.043860
15    24.473684
16    18.956140
17     9.464912
18    26.947368
19    30.973684
20    22.412281
21    16.263158
22    13.263158
23     2.333333
Name: registered, dtype: float64

In [180]:
res = abs(q2_sub_2.groupby('hour')['registered'].mean() - q2_sub_4.groupby('hour')['registered'].mean())

In [181]:
res = res.reset_index()
res

    hour  registered
0      0    4.070175
1      1    3.368421
2      2    1.210526
3      3    0.696429
4      4    1.034622
5      5    2.780702
6      6    2.350877
7      7    5.964912
8      8   22.210526
9      9   16.885965
10    10   15.368421
11    11   11.403509
12    12   17.561404
13    13   17.140351
14    14   20.043860
15    15   24.473684
16    16   18.956140
17    17    9.464912
18    18   26.947368
19    19   30.973684
20    20   22.412281
21    21   16.263158
22    22   13.263158
23    23    2.333333

In [183]:
res.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 24 entries, 0 to 23
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   hour        24 non-null     int32
 1   registered  24 non-null     float64
dtypes: float64(1), int32(1)
memory usage: 420.0 bytes

In [184]:
res.iloc[res['registered'].idxmax(),]

hour          19.000000
registered    30.973684
Name: 19, dtype: float64

# Q3

In [379]:
bike_q3 = pd.read_csv('bike.csv')

In [380]:
bike_q3

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0000,3,13,16
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0000,8,32,40
2,2011-01-01 02:00:00,1,0,0,1,9.02,13.635,80,0.0000,5,27,32
3,2011-01-01 03:00:00,1,0,0,1,9.84,14.395,75,0.0000,3,10,13
4,2011-01-01 04:00:00,1,0,0,1,9.84,14.395,75,0.0000,0,1,1
...,...,...,...,...,...,...,...,...,...,...,...,...
10881,2012-12-19 19:00:00,4,0,1,1,15.58,19.695,50,26.0027,7,329,336
10882,2012-12-19 20:00:00,4,0,1,1,14.76,17.425,57,15.0013,10,231,241
10883,2012-12-19 21:00:00,4,0,1,1,13.94,15.910,61,15.0013,4,164,168
10884,2012-12-19 22:00:00,4,0,1,1,13.94,17.425,61,6.0032,12,117,129
10885,2012-12-19 23:00:00,4,0,1,1,13.12,16.665,66,8.9981,4,84,88

In [381]:
bike_q3_sub = bike_q3
bike_q3_sub['datetime'] = pd.to_datetime(bike_q3_sub['datetime'])
bike_q3_sub

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0000,3,13,16
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0000,8,32,40
2,2011-01-01 02:00:00,1,0,0,1,9.02,13.635,80,0.0000,5,27,32
3,2011-01-01 03:00:00,1,0,0,1,9.84,14.395,75,0.0000,3,10,13
4,2011-01-01 04:00:00,1,0,0,1,9.84,14.395,75,0.0000,0,1,1
...,...,...,...,...,...,...,...,...,...,...,...,...
10881,2012-12-19 19:00:00,4,0,1,1,15.58,19.695,50,26.0027,7,329,336
10882,2012-12-19 20:00:00,4,0,1,1,14.76,17.425,57,15.0013,10,231,241
10883,2012-12-19 21:00:00,4,0,1,1,13.94,15.910,61,15.0013,4,164,168
10884,2012-12-19 22:00:00,4,0,1,1,13.94,17.425,61,6.0032,12,117,129
10885,2012-12-19 23:00:00,4,0,1,1,13.12,16.665,66,8.9981,4,84,88

In [280]:
bike_q3_sub['hour'] = bike_q3_sub['datetime'].dt.hour

In [382]:
bike_q3_sub['day'] = bike_q3_sub['datetime'].dt.date

In [383]:
bike_q3_sub

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count,day
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0000,3,13,16,2011-01-01
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0000,8,32,40,2011-01-01
2,2011-01-01 02:00:00,1,0,0,1,9.02,13.635,80,0.0000,5,27,32,2011-01-01
3,2011-01-01 03:00:00,1,0,0,1,9.84,14.395,75,0.0000,3,10,13,2011-01-01
4,2011-01-01 04:00:00,1,0,0,1,9.84,14.395,75,0.0000,0,1,1,2011-01-01
...,...,...,...,...,...,...,...,...,...,...,...,...,...
10881,2012-12-19 19:00:00,4,0,1,1,15.58,19.695,50,26.0027,7,329,336,2012-12-19
10882,2012-12-19 20:00:00,4,0,1,1,14.76,17.425,57,15.0013,10,231,241,2012-12-19
10883,2012-12-19 21:00:00,4,0,1,1,13.94,15.910,61,15.0013,4,164,168,2012-12-19
10884,2012-12-19 22:00:00,4,0,1,1,13.94,17.425,61,6.0032,12,117,129,2012-12-19
10885,2012-12-19 23:00:00,4,0,1,1,13.12,16.665,66,8.9981,4,84,88,2012-12-19

In [385]:
bike_q3_sub.groupby('day')['humidity'].max()

day
2011-01-01     94
2011-01-02    100
2011-01-03     69
2011-01-04     74
2011-01-05     74
             ...
2012-12-15     87
2012-12-16     93
2012-12-17    100
2012-12-18     94
2012-12-19     87
Name: humidity, Length: 456, dtype: int64

In [386]:
rainy_day = bike_q3_sub.groupby('day')['humidity'].max().reset_index()

In [387]:
rainy_day

            day  humidity
0    2011-01-01        94
1    2011-01-02       100
2    2011-01-03        69
3    2011-01-04        74
4    2011-01-05        74
..          ...       ...
451  2012-12-15        87
452  2012-12-16        93
453  2012-12-17       100
454  2012-12-18        94
455  2012-12-19        87

[456 rows x 2 columns]

In [388]:
rainy_day = rainy_day[rainy_day['humidity'] == 100]

In [389]:
rainy_day

            day  humidity
1    2011-01-02       100
20   2011-02-02       100
23   2011-02-05       100
25   2011-02-07       100
42   2011-03-05       100
43   2011-03-06       100
44   2011-03-07       100
48   2011-03-11       100
53   2011-03-16       100
57   2011-04-01       100
65   2011-04-09       100
66   2011-04-10       100
67   2011-04-11       100
69   2011-04-13       100
72   2011-04-16       100
89   2011-05-14       100
90   2011-05-15       100
91   2011-05-16       100
93   2011-05-18       100
94   2011-05-19       100
111  2011-06-17       100
158  2011-09-07       100
159  2011-09-08       100
160  2011-09-09       100
161  2011-09-10       100
182  2011-10-12       100
183  2011-10-13       100
189  2011-10-19       100
196  2011-11-07       100
199  2011-11-10       100
205  2011-11-16       100
214  2011-12-06       100
215  2011-12-07       100
263  2012-02-17       100
282  2012-03-17       100
401  2012-10-03       100
444  2012-12-08       100
445  2012-12-09       100
446  2012-12-10       100
453  2012-12-17       100

In [390]:
len(rainy_day)

40

In [391]:
q3_filtered = pd.merge(left=bike_q3_sub, right=rainy_day, left_on='day', right_on='day', how='inner')

In [392]:
q3_filtered.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 952 entries, 0 to 951
Data columns (total 14 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   datetime    952 non-null    datetime64[ns]
 1   season      952 non-null    int64
 2   holiday     952 non-null    int64
 3   workingday  952 non-null    int64
 4   weather     952 non-null    int64
 5   temp        952 non-null    float64
 6   atemp       952 non-null    float64
 7   humidity_x  952 non-null    int64
 8   windspeed   952 non-null    float64
 9   casual      952 non-null    int64
 10  registered  952 non-null    int64
 11  count       952 non-null    int64
 12  day         952 non-null    object
 13  humidity_y  952 non-null    int64
dtypes: datetime64[ns](1), float64(3), int64(9), object(1)
memory usage: 104.3+ KB

In [393]:
over_30 = q3_filtered[q3_filtered['temp'] > 30]

In [394]:
over_30

,datetime,season,holiday,workingday,weather,temp,atemp,humidity_x,windspeed,casual,registered,count,day,humidity_y
297,2011-04-11 15:00:00,2,0,1,1,30.34,33.335,48,35.0008,56,85,141,2011-04-11,100
298,2011-04-11 16:00:00,2,0,1,1,30.34,33.335,48,35.0008,73,162,235,2011-04-11,100
299,2011-04-11 17:00:00,2,0,1,1,30.34,33.335,48,35.0008,100,352,452,2011-04-11,100
487,2011-06-17 13:00:00,2,0,1,1,30.34,34.090,62,19.0012,48,156,204,2011-06-17,100
488,2011-06-17 14:00:00,2,0,1,1,31.16,34.850,52,12.9980,73,142,215,2011-06-17,100
489,2011-06-17 15:00:00,2,0,1,1,31.98,34.850,43,15.0013,62,181,243,2011-06-17,100
490,2011-06-17 16:00:00,2,0,1,1,31.16,34.090,45,11.0014,69,286,355,2011-06-17,100
491,2011-06-17 17:00:00,2,0,1,3,31.16,34.090,40,12.9980,85,467,552,2011-06-17,100
492,2011-06-17 18:00:00,2,0,1,3,31.16,34.090,40,12.9980,62,388,450,2011-06-17,100
560,2011-09-09 15:00:00,3,0,1,1,30.34,34.850,66,0.0000,27,161,188,2011-09-09,100
561,2011-09-09 16:00:00,3,0,1,1,30.34,34.850,66,8.9981,41,244,285,2011-09-09,100
582,2011-09-10 13:00:00,3,0,0,1,30.34,34.090,55,19.0012,131,239,370,2011-09-10,100
583,2011-09-10 14:00:00,3,0,0,1,30.34,34.090,55,19.0012,129,230,359,2011-09-10,100
584,2011-09-10 15:00:00,3,0,0,1,30.34,34.090,55,15.0013,217,263,480,2011-09-10,100
585,2011-09-10 16:00:00,3,0,0,1,30.34,34.090,55,12.9980,170,261,431,2011-09-10,100
586,2011-09-10 17:00:00,3,0,0,1,30.34,34.090,55,15.0013,185,275,460,2011-09-10,100

In [395]:
over_30['count'].mean()

np.float64(338.75)